<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Maintenance version for MacOS 10.14 and imports it into a Munki</string>
	<key>Identifier</key>
	<string>com.hjaltelinstahl.munki.Maintenance1014</string>
	<key>Input</key>
	<dict>
		<key>APP_DESTINATION</key>
		<string>/Applications</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Onyx</string>
		<key>NAME</key>
		<string>Maintenance</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Maintenance is an operating system maintenance and cleaning utility for macOS that you can use to run miscellaneous tasks of computer maintenance: run periodic scripts, rebuild the databases, delete application, font, and system caches, and more.</string>
			<key>developer</key>
			<string>Titanium</string>
			<key>display_name</key>
			<string>Maintenance for MacOS 10.14</string>
			<key>name</key>
			<string>Maintenance1014</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.hjaltelinstahl.download.Maintenance1014</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Comment</key>
			<string>This processor imports the final pkg into the location specified in the INPUT string at top of recipe.</string>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
